[Public]
Object=(Name=AMLadder.AMMenuAMItem,Class=Class,MetaClass=UMenu.UMenuModMenuItem)

[AMLadderAS]
MapTitle[3]="Guardia Fortress"
MapTitle[4]="Rook"
MapTitle[5]="OceanFloor Station #5"
MapTitle[6]="Mazon Fortress"
MapTitle[7]="Operation Overlord"
MapDescription[1]="A somewhat antiquated Earth warship, the restored SS Victory is still seaworthy. A dual security system prevents intruders from activating the guns only by allowing crew members to open the control room portal. However, should the aft boiler be damaged beyond repair the door will auto-release, allowing access to anyone."
MapDescription[3]="Attackers must enter the military base Guardia by setting the fuse to breach the cave wall, and then destroy the plasma tank."
MapDescription[4]="This ancient castle, nestled in the highlands of Romania, was purchased by Xan Kriegor as a personal training ground for his opponents, hoping to cull the best of the best to challenge him. The attacking team must open the main gates and escape the castle by breaking free the main winch in the library and throwing the gatehouse lever, while the defending team must prevent their escape."
MapDescription[5]="OceanFloor Station 5, built by universities around the globe for deep sea research, almost ran out of money when LC came to the rescue. Jerl Liandri President LC: 'If we can't ensure education for our children, what will come of this world?'"
MapDescription[6]="Nestled deep within the foothills of the jungle planet Zeus 6 lies Mazon Fortress, a seemingly impregnable stronghold. Deep within the bowels of the base resides an enormous shard of the rare and volatile element Tarydium. The shard is levitating between two enormous electron rods above a pool of superconductive swamp water."
MapDescription[7]="The tournament organizers at Liandri have decided that the recreation of arguably the Earth's most violent war would create the perfect arena of combat. Storming the beaches of Normandy in WWII was chosen in particular because of the overwhelming odds facing each member of the attacking force. Defending this beach, however, will prove to be no less of a daunting task."

[AMLadderChalMenu]
TrophyMap="EOL_Challenge.unr"
LadderName="Final Challenge"

[AMLadderCTFMenu]
TrophyMap="EOL_CTF.unr"
LadderName="Capture The Flag"

[AMLadderASMenu]
TrophyMap="EOL_Assault.unr"
LadderName="Assault"

[AMLadderDOMMenu]
TrophyMap="EOL_Domination.unr"
LadderName="Domination"

[AMLadderDMMenu]
TrophyMap="EOL_DeathMatch.unr"
LadderName="Deathmatch"

[RatedTeamInfo9]
TeamName="The Corrupt"
TeamBio="The Corrupt is Liandri's sponsored team entry in the Tournament. It is entirely made up of the best advanced AIs that the corporation's wealth can buy, and features the reigning champion, Xan Kriegor, as its leader."
BotNames[0]="Vector"
BotNames[1]="Cathode"
BotNames[2]="Matrix"
BotNames[3]="Silicon"
BotNames[4]="Divisor"
BotNames[5]="Tensor"
BotNames[6]="Function"
BotNames[7]="Enigma"
BotClassifications[0]="Slave Warrior"
BotClassifications[1]="Slave Warrior"
BotClassifications[2]="Slave Warrior"
BotClassifications[3]="Slave Warrior"
BotClassifications[4]="Slave Warrior"
BotClassifications[5]="Slave Warrior"
BotClassifications[6]="Slave Warrior"
BotClassifications[7]="Slave Warrior"
BotBio[0]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
BotBio[1]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
BotBio[2]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
BotBio[3]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
BotBio[4]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
BotBio[5]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
BotBio[6]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
BotBio[7]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."

[AMMenuAMWindow]
WindowTitle="Neon_Knight's Ladder"

[AMLadderDOM]
MapTitle[1]="Lament"
MapTitle[2]="Olden Aquifer"
MapTitle[3]="Condemned"
MapTitle[4]="Wolf's Bay"
MapTitle[5]="City Domination"
MapTitle[6]="Lament Redux"
MapTitle[7]="Cryptic"
MapTitle[8]="Ghardhen"
MapTitle[9]="Cinder Foundry"
MapTitle[10]="Gearbolt"
MapTitle[11]="Tomb of Sesmar"
MapTitle[12]="Leadworks"
MapTitle[13]="Metal Dream"
MapTitle[14]="Bullet Proof"
MapDescription[1]="This arena was originally a repair station for ground-based vehicles until jet propulsion advanced to the point of allowing flying personal passenger vehicles to become an inexpensive reality."
MapDescription[2]="This ancient temple was sacred to the race that built it, but not to Liandri. Upon discovering it nestled in the mountains above the Eternal Cave, desecrated it for battle."
MapDescription[3]="The many gang-related fights that ravaged this particular area have already proven this section of the city slums to be a bloody battleground. The Liandri organizers are expecting this to be the case once again, only this time, as a tournament domination arena."
MapDescription[4]="No description available."
MapDescription[5]="No description available."
MapDescription[6]="The original Lament Domination arena was a hit, especially for one-one-one competition. Due to 'non-appeal', Liandri decided to do anything it could to make this map stand out to the general public. Calling upon 2 of the best architects, they made the arena look more 'life-like', and also make it a fan favorite."
MapDescription[7]="One of the few 'manufactured' Tournament arenas, this ancient-seeming ruin was built by the legendary Tournament Master Kilbragh as a personal training facility. After his death, the property reverted to Liandri, who now makes full use of it."
MapDescription[8]="A newly constructed explosion testing facility, Ghardhen Labs houses two blast Chambers. Unfortunately, one of the silent investors was a Liandri scout, and Ghardhen fell to Liandri."
MapDescription[9]="After dozens of broken legs and incinerated employees, the Cinder Foundry was finally shut down and placed upon the auction block, where it was promptly snatched up by a savvy Liandri location scout."
MapDescription[10]="New peace treaties by the NEG have resulted in many abandoned military facilities. Gearbolt was one of an underground storage base for military weapons and inventory."
MapDescription[11]="Despite worldwide protests, this historical landmark is now owned by Liandri. Jerl Liandri, President of Liandri Mining Corporation: 'We owe it to the people to ensure quality cultural events. We won't settle for less.'"
MapDescription[12]="An old Leadworks on the wrong side of the tracks is an excellent place for war. You can expect molten lead still pooled in some areas of this facility. Step lightly if you plan on being effective."
MapDescription[13]="This oil rig has been converted into a Domination Arena. It is located near strange meteorological phenomenon in the northern reaches of Kryllia. Use the architecture to dominate your opponents."
MapDescription[14]="No description available."

[AMLadderDM]
MapTitle[3]="Fractal Reactor"
MapTitle[4]="Closer Resolution"
MapTitle[5]="Heavy Metal Grinder"
MapTitle[6]="Fetid Sewers"
MapTitle[7]="Morbias Redux"
MapTitle[8]="Viridian Dreams"
MapTitle[9]="Codex of Wisdom"
MapTitle[10]="Healing Pod Redux"
MapTitle[11]="Grit Duel"
MapTitle[12]="Arcane Temple"
MapTitle[13]="Cybrosis Redux"
MapTitle[14]="Stalwart Rematch"
MapTitle[15]="Turbine"
MapTitle[16]="Bishop"
MapTitle[17]="Liandri Central Core"
MapTitle[18]="Deck #16"
MapTitle[19]="The Peak Monastery"
MapTitle[20]="Pressure"
MapTitle[21]="Koos Galleon"
MapTitle[22]="The Pit of Agony"
MapTitle[23]="Mojo Redux"
MapTitle[24]="Orion's Barricade"
MapTitle[25]="Conveyor"
MapTitle[26]="Gothic Castle"
MapTitle[27]="Floating Pyramid"
MapTitle[28]="Shrapnel Redux"
MapTitle[29]="The Cranes"
MapDescription[2]="Jerl Liandri purchased this old mechanic's garage as a possible tax dump for his fledging company, Liandri Mining. Now, Liandri Corp. has converted it into a battle arena. While not very complex, it still manages to claim more lives than the slums of the city in which it lies."
MapDescription[4]="No description available."
MapDescription[5]="A former Liandri smelting facility, this complex has proven to be one of the bloodiest arenas for tournament participants. Lovingly called the Heavy Metal Grinder, those who enter can expect nothing less than brutal seek and destroy action."
MapDescription[6]="No description available."
MapDescription[7]="No description available."
MapDescription[8]="No description available."
MapDescription[9]="The Codex of Wisdom was to be a fantastic resource for knowledge seeking beings all across the galaxy. It was to be the last place in known space where one could access rare books in their original printed form. However, when the construction crew accidentally tapped into a magma flow, the project was aborted and sold to Liandri at a bargain price for combat purposes."
MapDescription[10]="A HealPod may sound cool in the middle of a battle, but it is a booby trap, so you must keep your eyes peeled at all times when enjoying this chemical 'Rejuvenation'. Combatants, however, have adapted to life without the 'Pod in the Tournament stop voted as 'Neurovision Fan's Choice Venue of the Year'."
MapDescription[11]="No description available."
MapDescription[12]="The Nali, an ancient race of four armed aliens, constructed this hidden temple to worship their Gods in secrecy when they were oppressed by the vicious Skaarj aliens. Unfortunately for the Nali, the Skaarj eventually located the temple and systematically slaughtered every inhabitant."
MapDescription[13]="No description available."
MapDescription[14]="It didn't take long for Jerl Liandri to realize that there was a hidden, but large, room behind closed garage doors. Amazed, he named his discovery as part of the battle arena and added some more powerful weapons, including Jerl's own personal favorite, the 'hellraising' Warhead Launcher."
MapDescription[15]="A decaying water-treatment facility that has been purchased for use in the Tourney, the Turbine Facility offers an extremely tight and fast arena for combatants which ensures that there is no running, and no hiding from certain death."
MapDescription[16]="No description available."
MapDescription[17]="A textbook Liandri ore processing facility located at Earth's Mohorovicic discontinuity roughly below Mexico. Phased ion shields hold back the intense heat and pressure characteristics of deep lithosphere mining."
MapDescription[18]="Interstellar Space Vehicle Gaetano is the largest space-faring vehicle ever built. When in drydock, it serves as a venue for tournament combat. All battles take place on the infamous Deck 16 of the cruiser. Try to stay out of the slime!"
MapDescription[19]="Originally built by the Nipi monks on Nepal to escape moral degradation, this serene and beautiful place once called for meditation; until Liandri acquired it for perfect tournament conditions."
MapDescription[20]="The booby trap is a time honored tradition and a favorite among Tournament viewers. Many Liandri mining facilities offer such 'interactive' hazards."
MapDescription[21]="The indigenous people of Koos World are waterborne and find there to be no more fitting an arena than the ancient transport galleon."
MapDescription[22]="Hidden deep within the jungles of the lush planet Valkyrus, this area was used by interplanetary smugglers as a storage location. Any unwitting tourists who stumbled upon the location were systematically tortured to death, hence the name."
MapDescription[23]="Famous arms smuggler Jihan Nyhn used this as training grounds for his bodyguards, now known as Iron Guard. After Nyhn's death, Liandri ripped off Nyhn's only child to add the arena to the ladder. Needless to say, it didn't go over well."
MapDescription[24]="A mysterious and ancient alien castle that hovers above an electrical storm, Orion's Barricade makes for a delightfully dangerous arena of battle."
MapDescription[25]="This refinery makes for a particularly well balanced arena. A multilevel central chamber keeps fighters on their toes while the nearby smelting tub keeps them toasty."
MapDescription[26]="Once the home to an eccentric billionaire, this Palace was foreclosed upon and sold for tourney purposes when the owner made several bad investments in illegal Tarydium mines and lost the shirt off his back when the operation was exposed. It is by sheer coincidence that the carpeting is red; it matches the blood stained walls appropriately."
MapDescription[27]="No description available."
MapDescription[28]="Tournament coordinators love burnt out factories, foundries, and warehouses because of the natural height and architectural hazards they provide. With the original name of this burnt-out facility long forgotten, the contestants have morbidly nicknamed this place."
MapDescription[29]="An incomplete tower, that was designed to be a department store, was quickly snatched away, as well as the cranes that were building it, by a Liandri Location Scout for bargain price. He later said on Neurovision, 'I've really done my job getting this tower, and I already know it's quickly going to pay off come the next Tourney.'"

[AMLadderCTF]
MapTitle[1]="Niven Experimental Lab"
MapTitle[4]="Coret Facility"
MapTitle[5]="Facing Worlds Rematch"
MapTitle[6]="The Iron Gauntlet"
MapTitle[7]="The Last Command"
MapTitle[8]="Facing Worlds Redux"
MapTitle[9]="Cybrosis Redux"
MapTitle[10]="Epic Boy"
MapTitle[11]="Hydro Bases"
MapTitle[12]="November Sub Pen"
MapTitle[13]="Dreary Outpost"
MapTitle[14]="Lava Giant"
MapTitle[15]="Noxion Base"
MapTitle[16]="Ratchet"
MapTitle[17]="Nucleus Power Plant"
MapTitle[18]="Temple of Beatitude"
MapTitle[19]="Hall Of Giants"
MapTitle[20]="Kosov Canyon"
MapTitle[21]="Darji Outpost #16-A"
MapTitle[22]="Orbital Station #12"
MapTitle[23]="High Towers"
MapDescription[1]="An experimental orbital nuclear reactor; abandoned after funding for the project dried up. High radiation levels and waste leakage offer an environmental challenge for Tournament combatants."
MapDescription[5]="No description available."
MapDescription[6]="Not all environments are retrofitted Liandri real estate. The Gauntlet is one of a small number of highly stylized combat arenas specifically designed for the Tournament. This particular venue has been customized for teamplay."
MapDescription[7]="The Last Command is a fully functional Nuclear Processing Station owned by the LC. This facility's system oriented layout makes an ideal proving grounds for the Capture the Flag Tournament matches. High Tech voluminous industrial architecture paired with curving maintenance corridors means fighting here will require quick reaction times if your team plans on surviving."
MapDescription[8]="After a cataclysmic disaster with a meteor that destroyed the original pair of facing temples and claiming 8 lives, including 4 Necris and 4 members of Raw Steel, The members of the Tournament insisted that Liandri build an almost-identical, but semi-resistant to a meteor attack, version of the famous Capture The Flag stop in the Tournament. Liandri listened, and a year after the destruction of the first, a second was introduced, with bases roughly 20% closer and featuring more sniping spots. Fans loved the non-stop action that kept them on the edge of their seats. Neurovision, the Tournament's leading broad caster, loved how much money came in as well in the following Tournaments."
MapDescription[9]="No description available."
MapDescription[10]="No description available."
MapDescription[11]="This enormous hydroelectric plant used to power the colonies on Vesuvius 9 until a mysterious virus killed everyone off. Now that a few years have passed, Liandri officials have declared the plant safe for combat (safe is relative to Liandri officials)."
MapDescription[12]="Battle around a retired November class nuclear submarine docked in an underground pen. This relic, from the First Cold War, still includes machinegun nests and defensive positions key to victory."
MapDescription[13]="This distant wastemarsh of Vandaron 3 is said to be the wettest place in the galaxy. A post dreaded by soldiers due to its remote location, cramped quarters and maddening echo of ever beating rain."
MapDescription[14]="This volatile world has an extremely low orbit around a superdense gas giant. The resulting gravitational forces have caused the planetary mantle to collapse. Combatants are issued special gravbelts for each match."
MapDescription[15]="No description available."
MapDescription[16]="No description available."
MapDescription[17]="No description available."
MapDescription[18]="No description available."
MapDescription[19]="Every now and then, Liandri uses a venue occupied by the Skaarj and its elite. This is such a venue. Used by the Skaarj for training purposes, Never did they think the NEG would favor a Team game in, or even locate, this unbelievably huge corridor."
MapDescription[20]="Along the infamous Pain River in Na Pali are these 2 abandoned temples. Liandri eventually found these temples, but, shockingly, not before the Dark Phalanx found it and called it their own. Liandri innocently blew huge money to have this as just another Tournament stop."
MapDescription[21]="No description available."
MapDescription[22]="The interior of this dual-sided space station may appear incomplete, but much functionality was never completed when funding ran out due to corrupt contractors and irresponsible administrators. As usual, the savvy Liandri location scouts caught wind of this and picked the station up at a discount for inclusion in the tourney."
MapDescription[23]="No description available."

[AMLadderChal]
MapTitle[0]="Phobos Moon"
MapTitle[1]="Tempest"
MapTitle[2]="Ice Station Zeto"
MapTitle[3]="Morpheus"
MapTitle[4]="Curse Redux"
MapTitle[5]="Malevolence"
MapTitle[6]="Space Noxx"
MapTitle[7]="HyperBlast"
MapDescription[0]="This Martian space station is caught between Mars and its satellite Phobos, resulting in a chaotic rotation. Fortunately, the gravity generators are working well enough to lend a fast paced rhythm to deathmatch."
MapDescription[1]="The Tempest Facility was built specifically for the tournament. It was designed strictly for arena combat, with multi-layered areas and tiny hiding spots. It is a personal training arena of Xan Kriegor and sits high above the sprawling Reconstructed New York City."
MapDescription[3]="LMC knew they had found an excellent arena at the very top of a newly constructed Galaxyscraper SuperStructure. Thanks to the modern miracle of super tensile solids, these three buildings reach a staggering 12 miles high at their pinnacle. The thin atmosphere and reduced influence of Earth's gravity provide an interesting test of the tournament athlete's ability to adapt and conquer in extreme environments."
MapDescription[4]="Excavation of this mysterious crypt was halted due to lack of funding, and the Liandri location scout swooped down on the area and struck a deal with the archeologists - allow the location to be included in several key tournament battles and Liandri would fund the remainder of the excavation."
MapDescription[5]="This small facility is well suited for testing rising tournament favorites in one-on-one combat."
MapDescription[6]="In the tradition of Morpheus, a favourite among fighters and fans alike, the members of the Tournament got together and manufactured a map of their own, and named it an open exhibition stop in the Tournament, and has remained like that ever since."
MapDescription[7]="Thanks to Magnetic Anti-Vacuum Resonance technology, combatants are able to battle outside of Xan's 'HyperBlast' ArenaShip for an extended period of time. Use extreme caution though, one mistake and you'll find yourself floating in space."

[AMKillGameQueryWindow]
WindowTitle="Delete Ladder Game?"

[RatedMatchDM11AM]
BotNames[0]="Darhl"
BotNames[1]="Reaper"
BotClassifications[0]="Psychotic"
BotClassifications[1]="classified: L9"
Bio[0]="The Tournament has a don't ask-don't tell policy on 'enhancement stimulants' and Darhl is known as a frequent abuser of these substances. He plays erratically, often ditching conventional range weapons in favor of the close-combat Impact Hammer."
Bio[1]="No profile available. Level 9 security clearance required."

[RatedMatchDM12AM]
BotNames[0]="Calameth"
BotNames[1]="Liche"
BotNames[2]="Raynor"
BotClassifications[0]="Soldier"
BotClassifications[1]="Unavailable"
BotClassifications[2]="Unavailable"
Bio[0]="Calameth was kicked from the NEG armed forces after a violent brush with his commanding officer. He has little care for those around him and will fight ruthlessly."
Bio[1]="No description available."
Bio[2]="No description available."

[RatedMatchDM13AM]
BotNames[0]="Deslok"
BotNames[1]="Doc Zenith"
BotNames[2]="Skirge"
BotClassifications[0]="Warrior"
BotClassifications[1]="Criminal"
BotClassifications[2]="Psychotic"
Bio[0]="Deslok is the clan mate of Drimacus. Although weaker than his warrior-brother, Deslok is a competent fighter and will prove a worthy opponent."
Bio[1]="The Doc is back and he's looking to rip you open.  Watch out, he's just off of a seven game victory streak and is looking to add you to his list of victims."
Bio[2]="Skirge is a ruthless murderer and he wouldn't want it any other way. This guy has his wires crossed...deriving pleasure from pain and vice versa. Probably the nastiest mother you'll ever meet."

[RatedMatchDM14AM]
BotNames[0]="Arkoth 24"
BotNames[1]="Riker"
BotNames[2]="Dominator"
BotClassifications[0]="Psychotic"
BotClassifications[1]="Warrior"
BotClassifications[2]="classified: L9"
Bio[0]="Arkoth's history is irrelevant, his memories lost during Liandri conditioning. Now a member of 'The Corrupt,' he serves Xan Kriegor's will without question."
Bio[1]="Riker is a walking fusion of tactics and style. He always tries to find new ways of killing his opponents and has won multiple awards for creative improvisation."
Bio[2]="No profile available. Level 9 security clearance required."

[RatedMatchDM15AM]
BotNames[0]="Cryss"
BotNames[1]="Raven"
BotNames[2]="Illana"
BotNames[3]="Sarena"
BotClassifications[0]="Necris Blademaiden"
BotClassifications[1]="Criminal"
BotClassifications[2]="Unavailable"
BotClassifications[3]="Unavailable"
Bio[0]="Member of an alien race known as the 'Necris', she takes pleasure in destruction. However, she is less likely to be overcome by a berserker rage. Distance weapons and silent tactics are her favorite. Cryss is possessed of a dark beauty. Beware, however, for it hides an even darker mind."
Bio[1]="Criminals make excellent pit fighters. The volatile combination of cabin fever and desperation that a long prison sentence imparts is therapeutic to say the least."
Bio[2]="No description available."
Bio[3]="Sarena is the result of a complex mind control experiment by the NEG. She fights not of her own volition, but as a test of government conditioning."

[RatedMatchDM16AM]
BotNames[0]="Dovienya"
BotNames[1]="Drimacus"
BotNames[2]="Nikki"
BotNames[3]="Luthienne"
BotClassifications[0]="Veteran Soldier"
BotClassifications[1]="Warrior"
BotClassifications[2]="Civilian"
BotClassifications[3]="Civilian"
Bio[0]="Dovienya's field expertise has guided her aim true. Now she has those same sights set on you."
Bio[1]="Unlike many other Tournament fighters, Drimacus has earned his position by ascending the lower ladders; fighting his way to the top of the amateur leagues. He is a very experienced and capable warrior."
Bio[2]="Occasionally, rich civilians are able to buy their way into the Tournament. The Liandri Rules Board doesn't like to include 'normal' civilians in the games because, frankly, they aren't good enough to be entertaining."
Bio[3]="Having survived the Wreck of the ISV-Kran, Luthienne was forced to watch all her friends and crewmates die at the hands of the Skaarj until she and 3 others were rescued two years later. Irreparably scarred by her experience, she has entered the Tournament to confront her inner demons and ultimately to silence them through her own death."

[RatedMatchDM17AM]
BotNames[0]="Athena"
BotNames[1]="Genghis"
BotNames[2]="Reaper"
BotNames[3]="Bart"
BotClassifications[0]="Warrior"
BotClassifications[1]="Raider/Prisoner"
BotClassifications[2]="classified: L9"
BotClassifications[3]="Economist"
Bio[0]="Athena fights for the sake of the battle. Her eyes sharp and her mind focused only on victory. Something drives her solely towards victory."
Bio[1]="Genghis takes his name from a conquerer of old. He proclaims himself 'Ruler of the Eastern Expanse' come to forge a new Empire. In reality, he is a petty freight raider sentenced to fight in the Tournament for his crimes."
Bio[2]="No profile available. Level 9 security clearance required."
Bio[3]="There isn't much worse than a lawyer, but economists come close. Liandri has discovered that civilians will pay good money to watch economists and other vermin take a beating."

[RatedMatchDM18AM]
BotNames[0]="Darhl"
BotNames[1]="Kregore"
BotNames[2]="Jayce"
BotNames[3]="Fuego"
BotClassifications[0]="Psychotic"
BotClassifications[1]="Veteran Soldier"
BotClassifications[2]="Civilian"
BotClassifications[3]="Criminal"
Bio[0]="Somebody pulled Darhl back together after your last brush with him and he's none too happy. Pumped up on the latest custom synthgland enhancers and bioregulators, he's more messed up than ever."
Bio[1]="Kregore fought with the 47th Mechanized Imperial during the First Necris Invasion. He is a distinguished veteran of modern military operations. Although his skills tend toward the tactical, he is, nonetheless, an excellent hand to hand fighter. Having survived multiple Tournament championships, he knows the venues well and is a very experienced warrior."
Bio[2]="Jayce is an ex-movie stunt woman. Figuring she could do it for real in the tournaments, she joined up and is proficient with any weapon."
Bio[3]="Ex-bodyguard for the famous performer Flabeline Xion. After he confessed to her gruesome murder, the only way out was the Liandri Tournaments. They call him 'the Singer.'"

[RatedMatchDM19AM]
BotNames[0]="Archon"
BotNames[1]="Kragoth"
BotNames[2]="Cilia"
BotNames[3]="Ichthys"
BotClassifications[0]="Psychotic"
BotClassifications[1]="Necris Phayder"
BotClassifications[2]="Warrior"
BotClassifications[3]="Unavailable"
Bio[0]="Archon is a ruthless murderer and he wouldn't want it any other way. This guy has his wires crossed...deriving pleasure from pain and vice versa. Probably the nastiest mother you'll ever meet."
Bio[1]="Also of the Necris, Kragoth is a known member of the 'Phayder' secret society. A brood of assassins and doomsday cultists, the Phayder have declared a sort of guerilla war against Earth. Known as the 'Star Slayer,' he is rumored to have single handedly killed the entire crew of an ICV Star Cruiser. Liandri will neither confirm nor deny this information."
Bio[2]="Cilia fights for perfection of self. She sees the Tournament as the greatest standard of physical strength devised and seeks to master it as she seeks to master herself."
Bio[3]="No description available."

[RatedMatchDM20AM]
BotNames[0]="Damascus"
BotNames[1]="Ice Weasel"
BotNames[2]="Gilfred"
BotNames[3]="Hijinxs"
BotClassifications[0]="Assassin"
BotClassifications[1]="Specialist"
BotClassifications[2]="Miner"
BotClassifications[3]="classified: L9"
Bio[0]="Orphaned after birth, this heartless killer spent years on the street, learning his trade and losing his emotions. The Corrupt had no difficulty in bending his will towards their ends. Now completely void of human feeling, Damascus is an unstoppable machine."
Bio[1]="Ice Weasel is the codename for Jesse Davis, a 'deep freeze' cold world combat specialist. Able to survive for weeks on melted snow alone, he has mastered control over his mind and body."
Bio[2]="Suckered into competing in the tournament by his former employers at Liandri Corp., this poor ex-miner stands no chance of winning the tournament. He is lost in despair and will do anything to kill an enemy, regardless of the damage to himself."
Bio[3]="No profile available. Level 9 security clearance required."

[RatedMatchDM21AM]
BotNames[0]="Vanessa"
BotNames[1]="Kara"
BotNames[2]="Cadaver"
BotNames[3]="Darhl"
BotClassifications[0]="Psychotic"
BotClassifications[1]="Unavailable"
BotClassifications[2]="Necris Murderer"
BotClassifications[3]="Psychotic"
Bio[0]="Vanessa's psychosis has proven her savior, ripping through ranks of warriors and fighters to get to this point in the ladder."
Bio[1]="No description available."
Bio[2]="A ruthlessly skilled murderer who knows every nook and cranny, every bolt, and every weapon location. His aggressive ability to control Tournament arenas makes easy prey out of challengers."
Bio[3]="You just can't stop these new style chem warriors.  Darhl is running low on strength, you can finish him now once and for all."

[RatedMatchDM22AM]
BotNames[0]="Karag"
BotNames[1]="Rath"
BotNames[2]="Andrew"
BotNames[3]="Slain"
BotClassifications[0]="Unavailable"
BotClassifications[1]="Warrior"
BotClassifications[2]="Criminal"
BotClassifications[3]="Veteran Soldier"
Bio[0]="No description available."
Bio[1]="Rath is more machine than human. Rebuilt from spare parts and what was left of his brain after the Earthstar One incident, his mental instabilities make him an excellent warrior."
Bio[2]="Andrew is serving a 30 year sentence for computer related crime. He is an intelligent programmer, systems cracker and hacker. A high breakout risk. Just the kind of guy you don't want to keep in prison very long."
Bio[3]="Slain fought with the 47th Mechanized Imperial during the First Necris Invasion. He is a distinguished veteran of modern military operations. Although his skills tend toward the tactical, he is, nonetheless, an excellent hand to hand fighter."

[RatedMatchDM23AM]
BotNames[0]="Toe Cutter"
BotNames[1]="Barak"
BotNames[2]="Kosak"
BotNames[3]="Cryss"
BotClassifications[0]="Criminal"
BotClassifications[1]="Unavailable"
BotClassifications[2]="Unavailable"
BotClassifications[3]="Necris Blademaiden"
Bio[0]="Real name unknown, the Toe Cutter is a notorious gang leader. Captured during a skirmish south of Reconstructed New York, there was no question to his participation in the Tournament."
Bio[1]="No description available."
Bio[2]="No description available."
Bio[3]="Kryss isn't out of the Tournament yet. The Necris are persistent and dangerous and she is no exception. Be careful, she is definitely more powerful than before."

[RatedMatchDM24AM]
BotNames[0]="Baetal"
BotNames[1]="Cali"
BotNames[2]="Nikki"
BotNames[3]="Barktooth"
BotClassifications[0]="classified: L9"
BotClassifications[1]="Criminal"
BotClassifications[2]="Civilian"
BotClassifications[3]="Psychotic"
Bio[0]="No profile available. Level 9 security clearance required."
Bio[1]="Many Tournament fighters are criminals given an opportunity to buy their freedom in blood. What they lack in general public appeal is made up for in their numbers."
Bio[2]="In three upset victories last week, Nikki proved that rich civilians can, in fact, be successful in the Tournament. She has learned a lot very quickly and has returned to show you some new tricks."
Bio[3]="Barktooth just can't be put down. His brute force tactics and disregard for his own well being have paid off as he moves even higher in the tournament ladder."

[RatedMatchDM25AM]
BotNames[0]="Necroth"
BotNames[1]="Berserker"
BotNames[2]="Loque"
BotNames[3]="Bruce"
BotClassifications[0]="Phayder Master"
BotClassifications[1]="classified: L9"
BotClassifications[2]="Necris Phayder"
BotClassifications[3]="Veteran Soldier"
Bio[0]="Necroth is Phayder Master for the Black Legion. Each Necris Master serves as a sort of dark chaplain, maintaining the morale of the group."
Bio[1]="No profile available. Level 9 security clearance required."
Bio[2]="Loque is a suspected Phayder captured snooping around the Io Directorship buildings. The Phayder have become more active as of late and are believed to be responsible for at least 6 tac-nuke bombings against NEG installations in the past month."
Bio[3]="Bruce is all about style. He'll often stop in the middle of a fight to make side comments towards the nearest holocam. A favorite among the inner worlds."

[RatedMatchDM26AM]
BotNames[0]="Malakai"
BotNames[1]="Arys"
BotNames[2]="Skrilax"
BotNames[3]="Tajheri"
BotClassifications[0]="Phayder Assassin"
BotClassifications[1]="Soldier"
BotClassifications[2]="classified: L9"
BotClassifications[3]="Civilian"
Bio[0]="Malakai fights for glory and destruction. He, like many Necris, believe that every emotion is to be savored, every nuance of pain divine."
Bio[1]="Arys is a field commander from the 12th Mechanized Imperial. She was selected for Tournament play after she single handedly killed 8 Skaarj with an energy knife during the battle for the Orion Stormwatch Outpost."
Bio[2]="No profile available. Level 9 security clearance required."
Bio[3]="Captured and forced into the slave trade, Tajheri made a daring escape and was later picked up by the NEG police and forced to fight in the tourney. She has little fighting experience and will be happy to find any gun at all."

[RatedMatchDM27AM]
BotNames[0]="Tamerlane"
BotNames[1]="Botanika"
BotNames[2]="Tamara"
BotNames[3]="Blake"
BotClassifications[0]="Unavailable"
BotClassifications[1]="Criminal"
BotClassifications[2]="Unavailable"
BotClassifications[3]="Arena Fighter"
Bio[0]="No description available."
Bio[1]="Rather than face execution at the hands of the Mars Prison Tribunal, Botanika chose to fight in the Tournament. With more than 11 brutal murders to his name, Botanika should have no problem adapting to arena combat."
Bio[2]="No description available."
Bio[3]="Blake is back and he's pissed. The first time you fought him, he lacked a lot of skill and tone, but now he thinks he can take you on. Show him where to stick it."

[RatedMatchDM28AM]
BotNames[0]="Nikita"
BotNames[1]="Bruce"
BotNames[2]="Anna"
BotNames[3]="Annaka"
BotNames[4]="Arys"
BotClassifications[0]="Dark Phalanx"
BotClassifications[1]="Veteran Soldier"
BotClassifications[2]="Civilian"
BotClassifications[3]="Demolitions Expert"
BotClassifications[4]="Soldier"
Bio[0]="Nikita was trained in the construction and maintenence of heavy weaponry and demolitions."
Bio[1]="A lucky second place in the Denarian playoffs has brought Bruce back for another round.  This guy is getting tedious...wipe him out!"
Bio[2]="Anna is an ex-circus performer who is forced into the tourney for financial reasons and she's none-too-happy about it. As a result, she loves the Ripper because she can juggle her opponents in the air with its explosive alternate fire."
Bio[3]="Never send a man to do a woman's job. Annaka is a premier demolitions expert. She masterminded over 20 covert structure hits against the Skaarj in less than a year and advises the NEG 'WetWorks' Board on Amphibious Arms Deployment."
Bio[4]="Although you were victorious over Arys, she has excelled in the losers bracket and returned to the tournament proper."

[RatedMatchDM29AM]
BotNames[0]="Cathode"
BotNames[1]="Divisor"
BotNames[2]="Enigma"
BotNames[3]="Matrix"
BotNames[4]="Tensor"
BotNames[5]="Vector"
BotClassifications[0]="Slave Warrior"
BotClassifications[1]="Slave Warrior"
BotClassifications[2]="Slave Warrior"
BotClassifications[3]="Slave Warrior"
BotClassifications[4]="Slave Warrior"
BotClassifications[5]="Slave Warrior"
Bio[0]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[1]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[2]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[3]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[4]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[5]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."

[RatedMatchDM2AM]
BotNames[0]="Dovienya"
BotClassifications[0]="Veteran Soldier"
Bio[0]="Born on board the IWV Battlecruiser Ciran-Vega and nursed on the scorched plains of the embattled Skaarj planet of Skrath, Dovienya is a highly experienced warrior. She knows the Tournament arenas better than her peers and learns quickly on the battlefield."

[RatedMatchDM3AM]
BotNames[0]="Alarik"
BotClassifications[0]="Unavailable"
Bio[0]="No description available."

[RatedMatchDM4AM]
BotNames[0]="Arachne"
BotNames[1]="Doc Zenith"
BotClassifications[0]="Unavailable"
BotClassifications[1]="Criminal"
Bio[0]="No description available."
Bio[1]="Zenith is one of the most skilled warriors the Tournament has ever seen. His fans call him the 'Doc' after the way he systematically dissects his opponents with the Ripper."

[RatedMatchDM5AM]
BotNames[0]="Leeb"
BotNames[1]="Lexington"
BotClassifications[0]="Necris Phayder"
BotClassifications[1]="Gun Fighter"
Bio[0]="Liandri suspects Leeb to be behind Phayder operations in the Sol sector. Believed to be responsible for over 543 politically motivated killings. Terminate with extreme prejudice."
Bio[1]="An extremely honorable warrior, Lexington is known for only using pistols to fight with. He considers himself above the Tourney and would rather take part in a traditional duel. His aim is legendary, and he becomes twice as lethal when he's got two pistols."

[RatedMatchDM6AM]
BotNames[0]="Malcolm"
BotNames[1]="Rhea"
BotClassifications[0]="Chem Killer"
BotClassifications[1]="Specialist"
Bio[0]="FenTech's finest creation, Malcolm is an engineered warrior enhanced by chemicals. Adrenaline stimulants, synaptic catalysts, and impulse regulators combine to create a superhuman killing machine."
Bio[1]="An ex-NEG field commander and energy weapons specialist, Rhea knows combat. She favors the Shock Rifle's accuracy, but is well trained with all modern weapons."

[RatedMatchDM7AM]
BotNames[0]="Barktooth"
BotNames[1]="Jared"
BotClassifications[0]="Psychotic"
BotClassifications[1]="Unavailable"
Bio[0]="Barktooth is a madman. Screaming with berserk rage, he would rather rip an opponent to shreds with his bare hands than fight from afar. When forced to use a gun, he favors the Flak Cannon's close range stopping power."
Bio[1]="No description available."

[RatedMatchDM8AM]
BotNames[0]="Kira"
BotNames[1]="Slasher"
BotClassifications[0]="Unavailable"
BotClassifications[1]="Criminal"
Bio[0]="No description available."
Bio[1]="Real name unknown, the Slasher is a notorious gang leader. Captured during a skirmish south of Reconstructed New York, there was no question to his participation in the Tournament."

[RatedMatchDM9AM]
BotNames[0]="Azure"
BotNames[1]="Visse"
BotClassifications[0]="Criminal"
BotClassifications[1]="Necris Blademaiden"
Bio[0]="Azure has served six long years on Mars for reasons that are currently classified. She was recently transferred to the Tournament, but no records of her history are available."
Bio[1]="Many Necris warriors are female. Known as 'Blademaiden,' they fight ruthlessly; favoring cruelly formed bayonets and energy swords. Visse is a Necris prisoner of war made to fight in the Tournament in exchange for her life."

[RatedTeamInfo10]
TeamName="Metal Guards"
TeamBio="A group of brainwashed and psychotic soldiers wearing metal masks. They serve Xan Kriegor as sparring partners for The Corrupt, and obey their master's will without hesitation."
BotNames[0]="Arkoth"
BotNames[1]="Risa"
BotNames[2]="Rath"
BotNames[3]="Vixen"
BotNames[4]="Barktooth"
BotNames[5]="Isis"
BotNames[6]="Damascus"
BotNames[7]="Tasha"
BotClassifications[0]="Metal Guard"
BotClassifications[1]="Metal Guard"
BotClassifications[2]="Metal Guard"
BotClassifications[3]="Metal Guard"
BotClassifications[4]="Metal Guard"
BotClassifications[5]="Metal Guard"
BotClassifications[6]="Metal Guard"
BotClassifications[7]="Metal Guard"
BotBio[0]="Arkoth's history was deleted during Liandri conditioning. Now a member of 'The Corrupt,' he serves Xan Kriegor's will without question."
BotBio[1]="Description not available."
BotBio[2]="Rath is more machine than human. Rebuilt from spare parts and what was left of his brain after the Earthstar One incident, his mental instabilities make him an excellent warrior."
BotBio[3]="Description not available."
BotBio[4]="Barktooth is a madman. Screaming with berserk rage, he would rather rip an opponent to shreds with his bare hands than fight from afar. When forced to use a gun, he favors the Flak Cannon's close range stopping power."
BotBio[5]="Description not available."
BotBio[6]="Orphaned after birth, this heartless killer spent years on the street, learning his trade and losing his emotions. The Corrupt had no difficulty in bending his will towards their ends. Now completely void of human feeling, Damascus is an unstoppable machine."
BotBio[7]="Description not available."

[RatedMatchDM10AM]
BotNames[0]="Vanessa"
BotNames[1]="Xoleras"
BotClassifications[0]="Psychotic"
BotClassifications[1]="Executioner"
Bio[0]="Vanessa was committed at a psychiatric institution at the age of twelve for murdering her parents and brother. This one is a real nut case. She likes to blow her opponents open with a well aimed rocket."
Bio[1]="A former Greek mob executioner on 'extended leave' from his 'family business', Xoleras has a reputation of completely and utterly dominating his opponents. A master of thin ledges and with vision of an eagle, he rarely misses an opportunity to blank an unskilled opponent."

[RatedMatchChal8AM]
BotNames[0]="Xan"
BotClassifications[0]="Tournament Champion"
Bio[0]="After his previous defeat in the Tournament, Xan has been rebuilt from the ground up. He's stronger, faster, and a hell of a lot meaner looking. And he's pissed. Defeat him, and the Tournament is yours!"

[RatedMatchChal6AM]
BotNames[0]="Rampage"
BotClassifications[0]="War Boss"
Bio[0]="Liandri researchers have been experimenting with recently uncovered Skaarj technology and have been implementing their results in a new model. Dubbed \"Rampage\", he's the fastest and most agile robot ever produced."

[RatedMatchChal5AM]
BotNames[0]="Indina"
BotNames[1]="Portia"
BotClassifications[0]="Aphex"
BotClassifications[1]="Aphex"
Bio[0]="One of the Aphex Twins, Indina is serving in the Tournament as one of the two Xan Kriegor's human bodyguards. They will ensure that their master will keep the crown as the Tournament's one and only champion."
Bio[1]="One of the Aphex Twins, Portia is serving in the Tournament as one of the two Xan Kriegor's human bodyguards. They will ensure that their master will keep the crown as the Tournament's one and only champion."

[RatedMatchChal4AM]
BotNames[0]="Function"
BotNames[1]="Cathode"
BotNames[2]="Enigma"
BotNames[3]="Matrix"
BotNames[4]="Tensor"
BotClassifications[0]="Slave Warrior"
BotClassifications[1]="Slave Warrior"
BotClassifications[2]="Slave Warrior"
BotClassifications[3]="Slave Warrior"
BotClassifications[4]="Slave Warrior"
Bio[0]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[1]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[2]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[3]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[4]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."

[RatedMatchChal3AM]
BotNames[0]="Matrix"
BotNames[1]="Tensor"
BotNames[2]="Vector"
BotNames[3]="Divisor"
BotNames[4]="Silicon"
BotClassifications[0]="Slave Warrior"
BotClassifications[1]="Slave Warrior"
BotClassifications[2]="Slave Warrior"
BotClassifications[3]="Slave Warrior"
BotClassifications[4]="Slave Warrior"
Bio[0]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[1]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[2]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[3]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[4]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."

[RatedMatchChal2AM]
BotNames[0]="Vector"
BotNames[1]="Divisor"
BotNames[2]="Silicon"
BotNames[3]="Function"
BotNames[4]="Cathode"
BotNames[5]="Enigma"
BotClassifications[0]="Slave Warrior"
BotClassifications[1]="Slave Warrior"
BotClassifications[2]="Slave Warrior"
BotClassifications[3]="Slave Warrior"
BotClassifications[4]="Slave Warrior"
BotClassifications[5]="Slave Warrior"
Bio[0]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[1]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[2]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[3]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[4]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[5]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."

[RatedMatchChal1AM]
BotNames[0]="Cathode"
BotNames[1]="Enigma"
BotNames[2]="Matrix"
BotNames[3]="Tensor"
BotClassifications[0]="Slave Warrior"
BotClassifications[1]="Slave Warrior"
BotClassifications[2]="Slave Warrior"
BotClassifications[3]="Slave Warrior"
Bio[0]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[1]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[2]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."
Bio[3]="A warrior slave. Member of 'The Corrupt,' a group of reprogrammed warriors who fight for the entertainment of Xan Kriegor."

[AMMenuAMItem]
MenuCaption="Neon_&Knight's Ladder"

